import numpy as np
import pandas as pd
import os
import xlsxwriter
zhiwei1=[
["后端开发",'Java', 'C++', 'PHP', '数据挖掘', '搜索算法', '精准推荐', 'C', 'C#', '全栈工程师', '.NET', 'Hadoop', 'Python', 'Delphi', 'VB', 'Perl', 'Ruby', 'Node.js', 'Go', 'ASP', 'Shell', '区块链', '后端开发其它']
,["移动开发",'HTML', 'Android', 'iOS', 'WP', '移动开发其它']
,["前端开发",'前端开发', 'web前端', 'Flash', 'html5', 'JavaScript', 'U3D', 'COCOS2D-X', '前端开发其它']
,["人工智能",'深度学习', '机器学习', '图像处理', '图像识别', '语音识别', '机器视觉', '算法工程师', '自然语言处理']
,["测试",'测试工程师', '自动化测试', '功能测试', '性能测试', '测试开发', '游戏测试', '白盒测试', '灰盒测试', '黑盒测试', '手机测试', '硬件测试', '测试经理', '测试其它']
,["运维",'运维工程师', '运维开发工程师', '网络工程师', '系统工程师', 'IT支持', 'IDC', 'CDN', 'F5', '系统管理员', '病毒分析', 'WEB安全', '网络安全', '系统安全', '运维经理']
,["DBA",'MySQL', 'SQLServer', 'Oracle', 'DB2', 'MongoDB', 'ETL', 'Hive', '数据仓库', 'DBA其它']
,["高端职位",'行政总监_经理', '财务总监_经理', 'HRD_HRM', 'CFO', 'CEO','策划经理','媒介经理', '市场总监', '公关总监', '媒介总监', '创意总监', '主编', '运营总监', 'COO', '客服总监','设计经理_主管', '设计总监', '视觉设计经理_主管', '视觉设计总监', '交互设计经理_主管', '交互设计总监', '用户研究经理_主管', '用户研究总监', '产品部经理', '产品总监', '游戏制作人','技术经理', '技术总监', '架构师', 'CTO', '运维总监', '技术合伙人', '项目总监', '测试总监', '安全专家', '高端技术职位其它']
,["项目管理",'项目经理', '项目助理']
,["硬件开发", '硬件', '嵌入式', '自动化', '单片机', '电路设计', '驱动开发', '系统集成', 'FPGA开发', 'DSP开发', 'ARM开发', 'PCB工艺', '材料工程师', '精益工程师', '射频工程师', '硬件开发其它']
,["企业软件",'实施工程师', '售前工程师', '售后工程师', 'BI工程师', '企业软件其它']
,["产品经理", '产品经理', '网页产品经理', '移动产品经理', '产品助理', '数据产品经理', '电商产品经理', '游戏策划', '产品实习生']
,["产品设计师",'网页产品设计师', '无线产品设计师']
,["视觉设计",'视觉设计师', '网页设计师', 'Flash设计师', 'APP设计师', 'UI设计师', '平面设计师', '美术设计师（2D_3D）', '广告设计师', '多媒体设计师', '原画师', '游戏特效', '游戏界面设计师', '游戏场景', '游戏角色', '游戏动作']
,["交互设计",'交互设计师', '无线交互设计师', '网页交互设计师', '硬件交互设计师']
,["用户研究",'数据分析师', '用户研究员', '游戏数值策划']
,["运营",'用户运营', '产品运营', '数据运营', '内容运营', '活动运营', '商家运营', '品类运营', '游戏运营', '网络推广', '运营专员', '网店运营', '新媒体运营', '海外运营', '运营经理']
,["编辑",'副主编', '内容编辑', '文案策划', '记者']
,["客服",'售前咨询', '售后客服', '淘宝客服', '客服经理']
,["市场营销",'市场营销', '市场策划', '市场顾问', '商务渠道', '商业数据分析', '活动策划', '网络营销', '海外市场', '商务专员']
,["媒体公关",'政府关系', '品牌公关', '广告协调', '媒介投放', '媒介合作', '媒介顾问']
,["品牌广告",'广告创意', '广告制作', '广告文案', '广告投放', '广告定价', '广告专员', '品牌合作', '品牌策划', '品牌专员', '美术指导']
,["渠道推广",'市场推广', '渠道推广', 'SEO', 'SEM']
,["销售",'销售专员', '销售顾问', '销售经理', '客户代表', '大客户代表', '客户经理', '商务拓展', '渠道销售', '代理商销售', '电话销售', '广告销售', '信用卡销售', '保险销售', '销售工程师', '商务渠道', '其他销售']
,["销售管理",'销售总监', '商务总监', '区域总监', '城市经理', '团队经理', '销售VP', '商务主管', '其他销售管理职位']
,["人力资源",'人力资源', '招聘', 'HRBP', '人事_HR', '培训经理', '薪资福利经理', '绩效考核经理', '员工关系']
,["行政",'助理', '前台', '行政', '总助', '文秘']
,["财务",'会计', '出纳', '财务', '结算', '税务', '审计', '风控']
,["法务",'法务', '律师', '专利']
,["游戏技术开发",'H5游戏开发', '小游戏开发', '游戏后端开发', 'C++游戏开发', 'FLASH', 'COCOS2D-X', 'U3D', '游戏测试']
,["游戏产品规划",'游戏制作人', '游戏产品经理', '游戏项目经理', '游戏策划', '剧情设计', '游戏文案']
,["设计",'游戏动画', '游戏原画', '游戏界面', '游戏场景', '游戏角色', '游戏动作', '游戏动效', '游戏美工']
,["运营推广",'游戏运营', '游戏编辑', '游戏推广', '手游推广', '页游推广']
,["游戏其他",'游戏主播', '游戏陪练', '游戏体验', '电竞主持', '电竞讲师']
]
# zhiwei1=[后端开发,移动开发,前端开发,人工智能,测试,运维,DBA,高端职位,项目管理,硬件开发,企业软件,产品经理,产品设计师,视觉设计,交互设计,用户研究,运营,编辑,客服,市场营销,媒体公关,品牌广告,渠道推广,销售,销售管理,人力资源,行政,财务,法务,游戏技术开发,游戏产品规划,设计,运营推广,游戏其他]


zhiwei1=np.array(zhiwei1)

def finds(name,zhiwei1):
    for i in range(len(zhiwei1)):
        for j in range(len(zhiwei1[i])):
            if name==zhiwei1[i][j]:
                return i,j



path="C:/Users/YYF/PycharmProjects/机器学习/venv/数据采集实验/数据采集课设/lagouclean2/"
path1="C:/Users/YYF/PycharmProjects/机器学习/venv/数据采集实验/数据采集课设/lagoujobclean/"
pathdir=os.listdir(path1)
for path2 in pathdir:
    if path2==".NET.xlsx":
        name=".NET"
    elif path2=="Node.js.xlsx":
        name="Node.js"
    else:
        name=path2.split(".")[0]
    print(name)
    i,j=finds(name,zhiwei1)
    df=pd.read_excel(path1+path2)
    df["name"]=name
    df["belong"]=zhiwei1[i][0]

    # list1 = df[(df.secondType != df.belong)].index.tolist()
    # df.drop(list1, inplace=True)
    # df.drop(columns=["Unnamed: 0","businessZones",'latitude', 'longitude','district',"companyLabelList","thirdType","positionName"],inplace=True)
    # df.drop(columns=["skillLables","Unnamed: 0"],inplace=True)
    df.reset_index(drop=True,inplace=True)
    path2=path+path2
    # print(path2)
    df.to_excel(path2,encoding="UTF-8",index=False)






# print(finds("深度学习"))
# print(zhiwei1[3])
# def fins
